app/views/tags/new.html.erb

SELECT "users".* FROM "users"
---
	Person that you want to tag:
	<%= f.select :user, options_for_select(@selectOptions) %>