app/views/photos/_add_comment.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "9"]]
---
<% author = User.find(comment.user_id) %>