app/views/photos/index.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = 1 LIMIT 1
---

<% @title = "Photos of #{@user.first_name}" %>

SELECT "comments".* FROM "comments" WHERE (photo_id = 15)
---
			<h4 class="comment_title"> Comments </h4>
			<% comments = Comment.where('photo_id = ?', photo.id).find(:all) %>