app/controllers/photos_controller.rb

	def index

		@id = params[:id]

		@user = User.find(@id)

		@photos = Photo.where('user_id = ?', @user).find(:all)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "9"]]
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = 1 LIMIT 1

	def create

		if session[:loggedin] == nil then
			flash[:notice] = "You must be logged in to upload photos"
			redirect_to "/users/login"
			return
		end

		@photo = params[:photo]
		if @photo == nil then

			flash[:notice] = "*You need to select a picture"
			redirect_to :action => "new"
			return

		else

			@photo = @photo[:picture]

			File.open(Rails.root.join('public', 'images', @photo.original_filename), 'wb') do |file|
				file.write(@photo.read)
			end

			user_id = session[:loggedin].id

			new_photo = Photo.new
			new_photo.user_id = user_id
			new_photo.date_time = DateTime.now
			new_photo.file_name = @photo.original_filename

			new_photo.save
---
INSERT INTO "photos" ("created_at", "date_time", "file_name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)