app/controllers/tags_controller.rb

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "20"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 14 LIMIT 1
SELECT "users".* FROM "users"
---
	def new

		if session[:loggedin] == nil then
			flash[:notice] = "* You must be logged in to tag photos"
			redirect_to "/users/login"
			return
		end

		@id = params[:id]
		@photo = Photo.find(@id)
		@user = @photo.user
		users = User.find(:all)
		@selectOptions = [["Select One", nil]]

		users.each do |u|

INSERT INTO "tags" ("created_at", "height", "photo_id", "relx", "rely", "updated_at", "user_id", "width") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create

		if session[:loggedin] == nil then
			flash[:notice] = "* You must be logged in to tag photos"
			redirect_to "/users/login"
			return
		end

		form = params[:tag]
		user_id = form["user"]
		@tag = Tag.new



		@tag.user_id = user_id
		@tag.photo_id = params[:id]
		@tag.relx = form[:relX]
		@tag.rely = form[:relY]
		@tag.width = form[:width]
		@tag.height = form[:height]

		if @tag.isUserPresent then
			flash[:notice] = "* You need to specify a person tagged"
			redirect_to :action => "new/#{params[:id]}"
			return
		end

		if @tag.valid? then

			@tag.save(:validate => false)

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "14"]]
---
	def index

		photo_id = params[:id]
		@photo = Photo.find(photo_id);