app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."login" = 'gposadas' LIMIT 1
---
	def post_login

		@login_user = User.new
		@login_user.login = params[:user][:login]
		input_password = params[:user][:password]


		if @login_user.login_fields_present?(input_password) then

			if @login_user.user_exists? then

				if @login_user.password_valid?(input_password) then

					@user = User.find_by_login(@login_user.login)

INSERT INTO "users" ("created_at", "first_name", "last_name", "login", "password_digest", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		if session[:loggedin] then
			flash[:notice] = "You are already logged in. You cant register a new user."
			redirect_to "/photos/index/#{session[:loggedin].id}"
			return
		end


		@user = params[:user]
		@register = User.new
		@register.first_name = @user[:first_name]
		@register.last_name = @user[:last_name]
		@register.login = @user[:login]

		if @register.fields_present?(@user[:password], @user[:password_confirmation]) then

			if @user[:password] != @user[:password_confirmation] then
				flash[:notice] = "* Passwords don't match. Try again."
				redirect_to :action => "new"
			else

				@register.password = @user[:password]
				@register.save(:validate => false)

SELECT "photos".* FROM "photos" WHERE "photos"."id" = 1 LIMIT 1
SELECT "photos".* FROM "photos"
SELECT "tags".* FROM "tags" WHERE "tags"."photo_id" = 1
---
	def search

		query = params[:text].downcase

		photos = Photo.find(:all)

		result = []
		resultTags = []
		resultComm = []

		photos.each do |photo|

			tags = photo.tags
			tags.each do |tag|